# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2^k),
# не превосходящие числа N.

# Пример:
# Ввод: 13 -> 1, 2, 4, 8

N = int(input('Введите предел: '))
M = 2
k = 0
numb = 0
res = []

while numb < N:
    numb = M ** k
    k += 1
    if numb <= N:
        res.append(numb)
print(res)
